БухЭксп/Reports/CW_ОжидаемыеЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОжидаемыеЗатраты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчетаРублевогоЭквивалентаПлановыхСтатейЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПорядокОтражения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическиПолученныеЗатратыНаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_ОжидаемыеЗатраты/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВызватьИсключение "Не выбрана версия бюджета!";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФактическиПолученныеЗатратыНаДату) Тогда
		ВызватьИсключение "Не указана дата получаения затрат.";
	КонецЕсли;
	
	СКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");  
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ФактическиПолученныеЗатратыНаДату); 

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, ДанныеРасшифровки, , );
	
	ТаблицаЗначений = Новый ТаблицаЗначений;  
	
	МассивГрузоперевозок = ПолучитьМассивГрузоперевозок(КомпоновщикНастроек.Настройки.Отбор);
	
	ВТ_ОжидаемыеЗатраты = ПолучитьТаблицуОжидаемыхЗатрат(МассивГрузоперевозок);
	ВнешнийНаборДанных = Новый Структура("ВТ_ОжидаемыеЗатраты", ВТ_ОжидаемыеЗатраты);
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;    
	ПроцессорВыводаРезультата.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ПолучитьТаблицуОжидаемыхЗатрат(МассивГрузоперевозок)
	
	ТаблицаОжидаемыхЗатрат = ПолучитьПустуюТаблицуОжидаемыхЗатрат(); 
	
	//ПорядокРасчетаРублевогоЭквивалента
	//По курсу статьи бюджета(0), По курсу на дату отчета(1)
	
	//Расходные статьи бюджета
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК ДокументДвижения,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец КАК Грузоперевозка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец.Заказ КАК Заказ,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов КАК ПорядокОтражения,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Сумма КАК СуммаПланВал,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего КАК СуммаСНДСПланВал,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаРуб КАК СуммаПлан,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб КАК СуммаСНДСПлан
	               |ПОМЕСТИТЬ ВТ_СтатьиПланирования
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&МассивГрузоперевозок)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = ЗНАЧЕНИЕ(Перечисление.CW_ВидыСтатейПланирования.Расходы)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	               |	КурсыВалютСрезПоследних.Курс КАК Курс,
	               |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	               |ПОМЕСТИТЬ ВТ_КурсыВалют
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(
	               |			&НаДату,
	               |			Валюта В
	               |				(ВЫБРАТЬ
	               |					ВТ_СтатьиПланирования.Валюта КАК Валюта
	               |				ИЗ
	               |					ВТ_СтатьиПланирования КАК ВТ_СтатьиПланирования)) КАК КурсыВалютСрезПоследних
	               |ГДЕ
	               |	&ПорядокРасчетаРублевогоЭквивалента = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СтатьиПланирования.Организация КАК Организация,
	               |	ВТ_СтатьиПланирования.ДокументДвижения КАК ДокументДвижения,
	               |	ВТ_СтатьиПланирования.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_СтатьиПланирования.Заказ КАК Заказ,
	               |	ВТ_СтатьиПланирования.Контрагент КАК Контрагент,
	               |	ВТ_СтатьиПланирования.Номенклатура КАК Номенклатура,
	               |	ВТ_СтатьиПланирования.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВТ_СтатьиПланирования.Валюта КАК Валюта,
	               |	ВТ_СтатьиПланирования.СуммаПланВал КАК СуммаПланВал,
	               |	ВТ_СтатьиПланирования.СуммаСНДСПланВал КАК СуммаСНДСПланВал,
	               |	ВЫБОР
	               |		КОГДА ВТ_КурсыВалют.Валюта ЕСТЬ NULL
	               |			ТОГДА ВТ_СтатьиПланирования.СуммаПлан
	               |		ИНАЧЕ ВТ_СтатьиПланирования.СуммаПланВал * ВТ_КурсыВалют.Курс / ВТ_КурсыВалют.Кратность
	               |	КОНЕЦ КАК СуммаПлан,
	               |	ВЫБОР
	               |		КОГДА ВТ_КурсыВалют.Валюта ЕСТЬ NULL
	               |			ТОГДА ВТ_СтатьиПланирования.СуммаСНДСПлан
	               |		ИНАЧЕ ВТ_СтатьиПланирования.СуммаСНДСПланВал * ВТ_КурсыВалют.Курс / ВТ_КурсыВалют.Кратность
	               |	КОНЕЦ КАК СуммаСНДСПлан
	               |ИЗ
	               |	ВТ_СтатьиПланирования КАК ВТ_СтатьиПланирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	               |		ПО ВТ_СтатьиПланирования.Валюта = ВТ_КурсыВалют.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов.Организация КАК Организация,
	               |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов КАК ДокументДвижения,
	               |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов.Дата КАК ДатаРасходов,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Грузоперевозка.Заказ КАК Заказ,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкамОбороты.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Валюта КАК Валюта,
	               |	CW_РасходыПоГрузоперевозкамОбороты.СуммаОборот КАК СуммаФакт,
	               |	CW_РасходыПоГрузоперевозкамОбороты.ВсегоОборот КАК СуммаСНДСФакт,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Сумма_ВалютаОборот КАК СуммаФактДокВал,
	               |	CW_РасходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот КАК СуммаСНДСФактДокВал
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(
	               |			,
	               |			&НаДату,
	               |			Период,
	               |			Грузоперевозка В (&МассивГрузоперевозок)
	               |				//УсловиеАктыСчет
				   |				) КАК CW_РасходыПоГрузоперевозкамОбороты";
	
	Запрос.УстановитьПараметр("НаДату", ФактическиПолученныеЗатратыНаДату); 
	Запрос.УстановитьПараметр("МассивГрузоперевозок", МассивГрузоперевозок);
	Запрос.УстановитьПараметр("ВерсияБюджета", ВерсияБюджета); 
	Запрос.УстановитьПараметр("ПорядокРасчетаРублевогоЭквивалента",	ПорядокРасчетаРублевогоЭквивалентаПлановыхСтатейЗатрат); 
	
	//Счета(СЧЕТА), Акты(АКТЫ)
	Если ФактическиеДокументы = "СЧЕТА" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеАктыСчета", "И ДокументРасходов.ПредъявленСчет = ИСТИНА");
	ИначеЕсли ФактическиеДокументы = "АКТЫ" Тогда  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеАктыСчета", "И ДокументРасходов.ПредъявленАкт = ИСТИНА");
	ИНАЧЕ
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеАктыСчета", "И ИСТИНА");
	КонецЕсли;
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();

	ТаблицаПлан = ПакетРезультатовЗапроса[2].Выгрузить(); 
	
	ТаблицаФакт = ПакетРезультатовЗапроса[3].Выгрузить();
	ТаблицаФакт.Колонки.Добавить("Учтено", Новый ОписаниеТипов("Булево"));
	
	ВалютаРегламентированногоучета = Константы.ВалютаРегламентированногоУчета.Получить();
	кэшКурсовВалют = Новый Соответствие;  
	
	Для Каждого СтрокаПлана из ТаблицаПлан Цикл
		
		НоваяСтрока = ТаблицаОжидаемыхЗатрат.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана); 
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Организация", 		СтрокаПлана.Организация);    
		ОтборСтрок.Вставить("Грузоперевозка", 	СтрокаПлана.Грузоперевозка);    
		ОтборСтрок.Вставить("Номенклатура", 	СтрокаПлана.Номенклатура);    
		ОтборСтрок.Вставить("Учтено", 			Ложь);    
		
		Если УчитыватьПорядокОтражения Тогда
			ОтборСтрок.Вставить("ПорядокОтражения", СтрокаПлана.ПорядокОтражения);    
		КонецЕсли; 
		
		Если УчитыватьПоставщика Тогда
			ОтборСтрок.Вставить("Контрагент", 		СтрокаПлана.Контрагент);    
		КонецЕсли; 
		
		НайденныеСтроки = ТаблицаФакт.НайтиСтроки(ОтборСтрок); 
		Для Каждого СтрокаФакт из  НайденныеСтроки Цикл
			НоваяСтрока = ТаблицаОжидаемыхЗатрат.Добавить();  
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаФакт,,"Валюта,Контрагент"); 
			
			НоваяСтрока.Контрагент		 = СтрокаПлана.Контрагент;
			НоваяСтрока.ПорядокОтражения = СтрокаПлана.ПорядокОтражения;
			НоваяСтрока.Валюта 			 = СтрокаПлана.Валюта;

			Если СтрокаФакт.Валюта = СтрокаПлана.Валюта Тогда
				НоваяСтрока.СуммаФактПланВал 		= СтрокаФакт.СуммаФактДокВал;
				НоваяСтрока.СуммаСНДСФактПланВал 	= СтрокаФакт.СуммаСНДСФактДокВал;
			Иначе    
				ДанныеСтроки = ПересчитатьВВалютуПлана(СтрокаФакт, НоваяСтрока.Валюта, ВалютаРегламентированногоучета, кэшКурсовВалют);
				НоваяСтрока.СуммаФактПланВал 		= ДанныеСтроки.СуммаФактПланВал;
				НоваяСтрока.СуммаСНДСФактПланВал 	= ДанныеСтроки.СуммаСНДСФактПланВал;
			КонецЕсли; 
			
			СтрокаФакт.Учтено = Истина;

		КонецЦикла;
		
	КонецЦикла;  
	
	ОтборНеучтено = Новый Структура;
	ОтборНеучтено.Вставить("Учтено", Ложь);
	
	НеучтенныеСтроки = ТаблицаФакт.НайтиСтроки(ОтборНеучтено);
	Для Каждого СтрокаФакт из  НеучтенныеСтроки Цикл
		НоваяСтрока = ТаблицаОжидаемыхЗатрат.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаФакт); 
		
		НоваяСтрока.СуммаФактПланВал 		= СтрокаФакт.СуммаФактДокВал;
		НоваяСтрока.СуммаСНДСФактПланВал 	= СтрокаФакт.СуммаСНДСФактДокВал;

		СтрокаФакт.Учтено = Истина;
	КонецЦикла;
	
	Возврат ТаблицаОжидаемыхЗатрат;   
	
КонецФункции

Функция ПересчитатьВВалютуПлана(Знач СтрокаФакт, Знач Валюта, Знач ВалютаРегламентированногоучета, Знач кэшКурсовВалют)
	
	ДанныеКурса = Неопределено;
	КурсыВалюты = кэшКурсовВалют.Получить(Валюта); 
	Если КурсыВалюты <> Неопределено Тогда
		ДанныеКурса = КурсыВалюты.Получить(НачалоДня(СтрокаФакт.ДатаРасходов));
	КонецЕсли;
	Если ДанныеКурса = Неопределено Тогда
		ДанныеКурса	= CW_Финансы.ПолучитьКурсВалюты(Валюта, СтрокаФакт.ДатаРасходов);
		
		//кэшируем         
		КурсНаДату = Новый Соответствие;
		КурсНаДату.Вставить(НачалоДня(СтрокаФакт.ДатаРасходов), ДанныеКурса);
		кэшКурсовВалют.Вставить(Валюта, КурсНаДату);
	КонецЕсли;
	
	СуммаФактПланВал = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаФакт.СуммаФакт, 
		ВалютаРегламентированногоучета,
		Валюта,
		1,
		ДанныеКурса.Курс,
		1,
		ДанныеКурса.Кратность);
	
	СуммаСНДСФактПланВал = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаФакт.СуммаСНДСФакт, 
		ВалютаРегламентированногоучета,
		Валюта,
		1,
		ДанныеКурса.Курс,
		1,
		ДанныеКурса.Кратность); 
		
	Структура = Новый Структура;
	Структура.Вставить("СуммаФактПланВал", 		СуммаФактПланВал);
 	Структура.Вставить("СуммаСНДСФактПланВал", 	СуммаСНДСФактПланВал); 
	
	Возврат Структура;

КонецФункции   

Функция ПолучитьМассивГрузоперевозок(ОтборКомпановкиДанных)  
	
	СКД = ПолучитьМакет("МакетОтбораГрузоперевозок");
	
	КомпоновщикМакетаОтбора = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроекОтбора = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекОтбора.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию); 
	
	Для Каждого ЭлементОтбораКомпановкиДанных Из ОтборКомпановкиДанных.Элементы Цикл  
		
		Если ТипЗнч(ЭлементОтбораКомпановкиДанных) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ЭлементОтбораКомпановкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Грузоперевозка")
			или ЭлементОтбораКомпановкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказ")
			ИЛИ СтрНачинаетсяС(ЭлементОтбораКомпановкиДанных.ЛевоеЗначение, "Грузоперевозка")  //Параметры и реквизиты грузоперевозки 
			ИЛИ СтрНачинаетсяС(ЭлементОтбораКомпановкиДанных.ЛевоеЗначение, "Заказ"))          //Параметры и реквизиты заказ
			И ЭлементОтбораКомпановкиДанных.Использование = Истина Тогда
			
			ЭлементОтбора = КомпоновщикНастроекОтбора.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементОтбораКомпановкиДанных); 
			
		КонецЕсли;  
		
	КонецЦикла;
	
	МакетКомпоновкиОтбра = КомпоновщикМакетаОтбора.Выполнить(СКД, КомпоновщикНастроекОтбора.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиОтбра);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;    
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);    
	
	ТаблицаГрузоперевозок = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТаблицаГрузоперевозок.ВыгрузитьКолонку("Грузоперевозка");
	
КонецФункции

Функция ПолучитьПустуюТаблицуОжидаемыхЗатрат()    
	
	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(Тип("ПеречислениеСсылка.CW_ПорядокОтраженияДоходов"));
	мПорядокОтражения.Добавить(Тип("ПеречислениеСсылка.CW_ПорядокОтраженияЗатрат"));
	ТипПорядокОтражения = Новый ОписаниеТипов(мПорядокОтражения);    
	
	мДокументДвижения = Новый Массив;
	мДокументДвижения.Добавить(Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов"));
	мДокументДвижения.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));  
	
	ТипДокументДвижения = Новый ОписаниеТипов(мДокументДвижения);    
	
	ТаблицаОжидаемыхЗатрат = Новый ТаблицаЗначений;
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Организация", 		Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Грузоперевозка", 	Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Контрагент", 		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("ПорядокОтражения", Новый ОписаниеТипов("ПеречислениеСсылка.CW_ПорядокОтраженияЗатрат"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Валюта", 			Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("Заказ", 			Новый ОписаниеТипов("СправочникСсылка.CW_Заказы"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("ДокументДвижения", ТипДокументДвижения);     
	
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаПланВал", 		Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаСНДСПланВал", 	Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаПлан", 			Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаСНДСПлан", 		Новый ОписаниеТипов("Число"));  
	
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаФактПланВал", 		Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаСНДСФактПланВал", 	Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаФактДокВал", 			Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаСНДСФактДокВал", 		Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаФакт", 				Новый ОписаниеТипов("Число"));
	ТаблицаОжидаемыхЗатрат.Колонки.Добавить("СуммаСНДСФакт", 			Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаОжидаемыхЗатрат;
	
КонецФункции
